some_str = 'hello, WORLD !'
# print(some_str.capitalize()) - первый символ с большой буквы.
# print(some_str.upper()) - переводит строку в верхний регистр.
# print(some_str.lower()) - переводит строку в нижний регистр.
# print(some_str.islower()) - проверяет вся ли строка находится в нижнем регистре.
# print(some_str.isupper()) - проверяет вся ли строка находится в верхнем регистре.
# print(some_str.count('l')) - кол-во вхождений определенного символа в строке. 
# print(some_str.find('!')) - индекс первого вхождения в строке.
# print(some_str.find('l',2,5))  - может принимать 3 агрумента: 1-й искомый символ, 2-й с какого индекса, 3-й каким индексом закончить поиск.
# print(some_str.isalnum()) - функция проверяет, все ли символы в заданной строке являются буквенно-цифровыми.
# print(some_str.isalpha()) - возвращает True, если все символы в строке являются алфавитными. Если нет, возвращается False.
# print(some_str.strip()== '') - проверка на пустую строку, даже если она содержит пробельные символы